def area(a, b):

    '''
    Принимает числа a, b (ширина прямоугольника, длина прямоугольника), возвращает произведение a и b (площадь прямоугольника)
    :param a: ширина прямоугольника
    :param b: длина прямоугольника
    :return: произведение a (ширины) и b (длины) прямоугольника (площадь)
    '''

    return a * b 

def perimeter(a, b):

    '''
    Принимает числа a, b (ширина, длина прямоугольника), возвращает произведение суммы (a + b) и 2 (площадь)
    :param a: шарина прямоугольника
    :param b: длина прямоугольника
    :return: Периметр прямоугольника ((ширина + длина) * 2)
    '''

    return (a + b) * 2 
