def area(a, h):

    '''
    Принимает числа a, h, возвращает частное произведение чисел (a и h) и 2
    :param a: сторона треугольника
    :param h: высота треугольника
    :return: частное произведения чисел (a и h) и числа 2 (площадь треугольника)
    '''

    return a * h / 2 

def perimeter(a, b, c):

    '''
    Принимает числа a, b, c, возвращает сумму чисел a, b, c.
    :param a: сторона треугольника
    :param b: сторона тругольника
    :param c: сторона треугольника
    :return: Сумма числе a, b, c (периметр треугольника).
    '''

    return a + b + c 
